OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18lf8723.h
//----------------------------- CONFIG5H Options -------------------------------

#define _CPB_ON_5H              0xBF    // Boot Block (000000-0007FFh) code-protected.
#define _CPB_OFF_5H             0xFF    // Boot Block (000000-0007FFh) not code-protected.
#define _CPD_ON_5H              0x7F    // Data EEPROM code-protected.
#define _CPD_OFF_5H             0xFF    // Data EEPROM not code-protected.

//----------------------------- CONFIG6L Options -------------------------------

#define _WRT0_ON_6L             0xFE    // Block 0 (000800, 001000 or 002000-003FFFh) write-protected.
#define _WRT0_OFF_6L            0xFF    // Block 0 (000800, 001000 or 002000-003FFFh) not write-protected.
#define _WRT1_ON_6L             0xFD    // Block 1 (004000-007FFFh) write-protected.
#define _WRT1_OFF_6L            0xFF    // Block 1 (004000-007FFFh) not write-protected.
#define _WRT2_ON_6L             0xFB    // Block 2 (008000-00BFFFh) write-protected.
#define _WRT2_OFF_6L            0xFF    // Block 2 (008000-00BFFFh) not write-protected.
#define _WRT3_ON_6L             0xF7    // Block 3 (00C000-00FFFFh) write-protected.
#define _WRT3_OFF_6L            0xFF    // Block 3 (00C000-00FFFFh) not write-protected.
#define _WRT4_ON_6L             0xEF    // Block 4 (010000-013FFFh) write-protected.
#define _WRT4_OFF_6L            0xFF    // Block 4 (010000-013FFFh) not write-protected.
#define _WRT5_ON_6L             0xDF    // Block 5 (014000-017FFFh) write-protected.
#define _WRT5_OFF_6L            0xFF    // Block 5 (014000-017FFFh) not write-protected.
#define _WRT6_ON_6L             0xBF    // Block 6 (01BFFF-018000h) write-protected.
#define _WRT6_OFF_6L            0xFF    // Block 6 (01BFFF-018000h) not write-protected.
#define _WRT7_ON_6L             0x7F    // Block 7 (01C000-01FFFFh) write-protected.
#define _WRT7_OFF_6L            0xFF    // Block 7 (01C000-01FFFFh) not write-protected.

//----------------------------- CONFIG6H Options -------------------------------

#define _WRTC_ON_6H             0xDF    // Configuration registers (300000-3000FFh) write-protected.
#define _WRTC_OFF_6H            0xFF    // Configuration registers (300000-3000FFh) not write-protected.
#define _WRTB_ON_6H             0xBF    // Boot Block (000000-007FFF, 000FFF or 001FFFh) write-protected.
#define _WRTB_OFF_6H            0xFF    // Boot Block (000000-007FFF, 000FFF or 001FFFh) not write-protected.
#define _WRTD_ON_6H             0x7F    // Data EEPROM write-protected.
#define _WRTD_OFF_6H            0xFF    // Data EEPROM not write-protected.

//----------------------------- CONFIG7L Options -------------------------------

#define _EBTR0_ON_7L            0xFE    // Block 0 (000800, 001000 or 002000-003FFFh) protected from table reads executed in other blocks.
#define _EBTR0_OFF_7L           0xFF    // Block 0 (000800, 001000 or 002000-003FFFh) not protected from table reads executed in other blocks.
#define _EBTR1_ON_7L            0xFD    // Block 1 (004000-007FFFh) protected from table reads executed in other blocks.
#define _EBTR1_OFF_7L           0xFF    // Block 1 (004000-007FFFh) not protected from table reads executed in other blocks.
#define _EBTR2_ON_7L            0xFB    // Block 2 (008000-00BFFFh) protected from table reads executed in other blocks.
#define _EBTR2_OFF_7L           0xFF    // Block 2 (008000-00BFFFh) not protected from table reads executed in other blocks.
#define _EBTR3_ON_7L            0xF7    // Block 3 (00C000-00FFFFh) protected from table reads executed in other blocks.
#define _EBTR3_OFF_7L           0xFF    // Block 3 (00C000-00FFFFh) not protected from table reads executed in other blocks.
#define _EBTR4_ON_7L            0xEF    // Block 4 (010000-013FFFh) protected from table reads executed in other blocks.
#define _EBTR4_OFF_7L           0xFF    // Block 4 (010000-013FFFh) not protected from table reads executed in other blocks.
#define _EBTR5_ON_7L            0xDF    // Block 5 (014000-017FFFh) protected from table reads executed in other blocks.
#define _EBTR5_OFF_7L           0xFF    // Block 5 (014000-017FFFh) not protected from table reads executed in other blocks.
#define _EBTR6_ON_7L            0xBF    // Block 6 (018000-01BFFFh) protected from table reads executed in other blocks.
#define _EBTR6_OFF_7L           0xFF    // Block 6 (018000-01BFFFh) not protected from table reads executed in other blocks.
#define _EBTR7_ON_7L            0x7F    // Block 7 (01C000-01FFFFh) protected from table reads executed in other blocks.
#define _EBTR7_OFF_7L           0xFF    // Block 7 (01C000-01FFFFh) not protected from table reads executed in other blocks.

//----------------------------- CONFIG7H Options -------------------------------

#define _EBTRB_ON_7H            0xBF    // Boot Block (000000-007FFF, 000FFF or 001FFFh) protected from table reads executed in other blocks.
#define _EBTRB_OFF_7H           0xFF    // Boot Block (000000-007FFF, 000FFF or 001FFFh) not protected from table reads executed in other blocks.

//==============================================================================

#define __DEVID1                0x3FFFFE
#define __DEVID2                0x3FFFFF

#define __IDLOC0                0x200000
#define __IDLOC1                0x200001
#define __IDLOC2                0x200002
#define __IDLOC3                0x200003
#define __IDLOC4                0x200004
#define __IDLOC5                0x200005
#define __IDLOC6                0x200006
#define __IDLOC7                0x200007

#endif // #ifndef __PIC18LF8723_H__
